apps/docs/scripts/load-test.yml
config:
  target: "http://localhost:3003"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Normal load"
    - duration: 60
      arrivalRate: 100
      name: "High load"
  processor: "./load-test-processor.js"
  
scenarios:
  - name: "Homepage visit"
    weight: 3
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
            - contentType: "text/html"
            - maxResponseTime: 2000
            
  - name: "Documentation browsing"
    weight: 5
    flow:
      - get:
          url: "/"
      - think: 3
      - get:
          url: "/docs/getting-started"
          expect:
            - statusCode: 200
            - maxResponseTime: 2000
      - think: 5
      - get:
          url: "/docs/installation"
          expect:
            - statusCode: 200
            - maxResponseTime: 2000
      - think: 3
      - get:
          url: "/docs/api-reference"
          expect:
            - statusCode: 200
            - maxResponseTime: 2000
            
  - name: "API documentation access"
    weight: 2
    flow:
      - get:
          url: "/api-docs/globals"
          expect:
            - statusCode: 200
            - maxResponseTime: 2000
      - think: 2
      - get:
          url: "/api-docs/README"
          expect:
            - statusCode: 200
            - maxResponseTime: 2000